---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOption
source: html/71b38936-4019-4968-b834-6ae8650bc851.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOption Property

A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOption { get; }
```